# DGNImportOptions Constructor (DGNImportOptions) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DGNImportOptions Constructor (DGNImportOptions)
DGNImportOptions Class See Also
---
Constructs a new instance of DGNImportOptions as a copy of the import options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public DGNImportOptions(
	DGNImportOptions option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As DGNImportOptions _
)
```

Visual C++
---
```text
public:
DGNImportOptions(
	DGNImportOptions^ option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..DGNImportOptions
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DGNImportOptions Class
DGNImportOptions Overload
Autodesk.Revit.DB Namespace